In [ ]:
import pandas as pd
# creating DataFrame from dictionary
data= {
    "Name": ['Nihal','Robert','Alon','tom'],
    'Age': [18,21,19,18],
    'City': ['New York','Los Angeles','Chicago','Houston']
}
df=pd.DataFrame(data)
print(df)

     Name  Age         City
0   Nihal   18     New York
1  Robert   21  Los Angeles
2    Alon   19      Chicago
3     tom   18      Houston

In [ ]:
#creating a dataframe from a list of dictionary
data=[
    {'Name':'Nihal','Age':18,'City':'New York'},
    {'Name':'John','Age':21,'City':'Los Angeles'},
    {'Name':'Alon','Age':19,'City':'Chicago'},
    {'Name':'tom',"Age":34,"City":'New Jersey'}
]
df=pd.DataFrame(data)
print(df)

    Name  Age         City
0  Nihal   18     New York
1   John   21  Los Angeles
2   Alon   19      Chicago
3    tom   34   New Jersey

In [31]:
# creating dataframe from a csv file
data=pd.read_csv("sample_data.csv")
print(data)

             Name  Age         City
0        John Doe   28     New York
1      Jane Smith   34  Los Angeles
2     Emily Davis   22      Chicago
3   Michael Brown   45      Houston
4  Jessica Wilson   29      Phoenix

In [ ]:
#viewing data
print(data.head())#prints first 5 rows
print(data.tail())#prints last 5 rows

             Name  Age         City
0        John Doe   28     New York
1      Jane Smith   34  Los Angeles
2     Emily Davis   22      Chicago
3   Michael Brown   45      Houston
4  Jessica Wilson   29      Phoenix
             Name  Age         City
0        John Doe   28     New York
1      Jane Smith   34  Los Angeles
2     Emily Davis   22      Chicago
3   Michael Brown   45      Houston
4  Jessica Wilson   29      Phoenix

In [33]:
#getting detail about the DataFrame
print(data.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     5 non-null      int64
 2   City    5 non-null      object
dtypes: int64(1), object(2)
memory usage: 248.0+ bytes
None

In [ ]:
print(df.describe())

             Age
count   4.000000
mean   19.000000
std     1.414214
min    18.000000
25%    18.000000
50%    18.500000
75%    19.500000
max    21.000000

In [32]:
print(df)
# print(df.Name)
print(df['Name'])

    Name  Age      City   Bonus
0  Nihal   19  New York  1000.0
2   Alon   20   Chicago  3000.0
3    tom   19   Houston  4000.0
0    Nihal
2     Alon
3      tom
Name: Name, dtype: object

In [ ]:
print(df[['Name','Age']])

     Name  Age
0   Nihal   18
1  Robert   21
2    Alon   19
3     tom   18

In [ ]:
# filtering row based on condition
print(df[df['Age']>19])

     Name  Age         City
1  Robert   21  Los Angeles

In [ ]:
#adding colomn in dataFrame
df['Salary']=[10000,20000,30000,40000]
# df['Bonus']=df['Salary']*0.1
print(df)

     Name  Age         City   Bonus  Salary
0   Nihal   19     New York  1000.0   10000
1  Robert   22  Los Angeles  2000.0   20000
2    Alon   20      Chicago  3000.0   30000
3     tom   19      Houston  4000.0   40000

In [ ]:
# modifying existing coloumn
df['Age']=df['Age']+1
print(df)

     Name  Age         City  Salary   Bonus
0   Nihal   19     New York   10000  1000.0
1  Robert   22  Los Angeles   20000  2000.0
2    Alon   20      Chicago   30000  3000.0
3     tom   19      Houston   40000  4000.0

In [ ]:
# dropping a coloumn
df=df.drop(columns=['Salary'])
print(df)

     Name  Age         City   Bonus
0   Nihal   19     New York  1000.0
1  Robert   22  Los Angeles  2000.0
2    Alon   20      Chicago  3000.0
3     tom   19      Houston  4000.0

In [34]:
#dropping a row
df=df.drop([1])#or df=df.drop(index=1)
print(df)

KeyError: '[1] not found in axis'

In [35]:
df=pd.read_csv("sample_data.csv")
print(df)

             Name  Age         City
0        John Doe   28     New York
1      Jane Smith   34  Los Angeles
2     Emily Davis   22      Chicago
3   Michael Brown   45      Houston
4  Jessica Wilson   29      Phoenix

In [39]:
# grouping data by coloumn
grouped=df.groupby('City')
print(grouped)
print(grouped['Age'].mean())

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x7b85a30d3c10>
City
Chicago        22.0
Houston        45.0
Los Angeles    34.0
New York       28.0
Phoenix        29.0
Name: Age, dtype: float64

In [43]:
# aggregating the  data
aggregated=df.groupby('City').agg({'Age':['mean','min','max']})
print(aggregated)

              Age
             mean min max
City
Chicago      22.0  22  22
Houston      45.0  45  45
Los Angeles  34.0  34  34
New York     28.0  28  28
Phoenix      29.0  29  29

In [48]:
# Merging the two dataframe
df1=pd.DataFrame({'ID':[1,2,3,4],'Name':['Nihal','John','Alon','tom']})
df2=pd.DataFrame({'ID':[1,2,3,5],'City':['New York','Los Angeles','Chicago','Houston']})
merged_data=pd.merge(df1,df2,on='ID',how='inner')#the inner joins only the common part while outer joins all
print(merged_data)

   ID   Name         City
0   1  Nihal     New York
1   2   John  Los Angeles
2   3   Alon      Chicago

In [59]:
# joinning the two dataframes
frame1=pd.DataFrame({'ID':[1,2,3,4],'Name':['Nihal','John','Alon','tom']},index=[0,1,2,3])
frame2=pd.DataFrame({'City':['New York','Los Angeles','Chicago','Houston']},index=[0,1,2,4])
joined_data=frame1.join(frame2,how='left')
print(joined_data)

   ID   Name         City
0   1  Nihal     New York
1   2   John  Los Angeles
2   3   Alon      Chicago
3   4    tom          NaN